# Παραγοντικό π.χ. 3!
#3 *2 * 1
#3 * (2 * (1))

.text
addiu $a0, $zero, 3
jal factorial
move $s0,$v0

li $v0, 1
move $a0, $s0
syscall

exit_module: li $v0, 10 #10= system code for exit $v0=o καταχωρητής που λαμβάνει το system code
syscall

factorial: addi $sp, $sp, -8 # προσαρμόζουμε τη στοίβα για δύο στοιχεία
	sw $ra, 4($sp) # αποθηκεύουμε τη διεύθυνση επιστροφής
	sw $a0, 0($sp) # αποθηκεύουμε το όρισμα
	slti $t0, $a0, 1 # έλεγχος κατά πόσο έχουμε φθάσει σε φύλλο
	beq $t0, $zero, L1
	addi $v0, $zero, 1 # εάν έχουμε φθάσει σε φύλλο, αρχικοποιούμε με την τιμή 1 και επιστρέφουμε
	addi $sp, $sp, 8 # αποδίδουμε/αποδεσμεύουμε τη μνήμη
	jr $ra # επιστρέφουμε στον καλούντα

L1: addi $a0, $a0, -1 # εάν δεν έχουμε φθάσει σε φύλλο
	jal factorial # καλούμε αναδρομικά (επέκταση προς τα κάτω)
	lw $a0, 0($sp) # μετά την επιστροφή από την αναδρομή – ανακτούμε το όρισμα
	lw $ra, 4($sp) # μετά την επιστροφή από την αναδρομή – ανακτούμε τη διεύθυνση επιστροφής
	addi $sp, $sp, 8 # αποδίδουμε/αποδεσμεύουμε τη μνήμη
	mul $v0, $a0, $v0 # εφαρμόζουμε την αναδρομική συνάρτηση - multiply για να λάβουμε το αποτέλεσμα
	
	jr $ra # και ανεβαίνουμε/επιστρέφουμε ένα βήμα στην ιεραρχία της αναδρομής