.text
main:
addiu $a0, $zero, 5 #αρχικοποιώ το όρισμα με 5
jal myfactorial
move $s0,$v0 #μεταφέρω το αποτέλεσμα σε μια μεταβλητή

li $a0, 2 #θέτω τη τιμή του ορίσματος ως 2
jal myfactorial
move $s1,$v0 #μεταφέρω το αποτέλεσμα σε μια μεταβλητή

li $a0, 3 #θέτω τη τιμή του ορίσματος ως 3
jal myfactorial
move $s2,$v0 #μεταφέρω το αποτέλεσμα σε μια μεταβλητή

mul $s3, $s1, $s2 #πολ/ζω τον παρονομαστή
div $s4, $s0, $s3 #διαιρώ τον αριθμητή με τον παρονομαστή

move $a0, $s4 #μεταφέρω το αποτέλεσμα της διαίρεσης στον καταχωρητή $a0 για εκτύπωση
li $v0, 1 #κωδικός για εκτύπωση
syscall #καλώ το σύστημα και εκτυπώνω

exit_module: li $v0, 10 #10= system code for exit
syscall #καλώ το σύστημα και βγαίνω

myfactorial: addi $sp, $sp, -8 #προσαρμόζω τη στοίβα για δύο στοιχεία(λαμβάνω τους κατάλληλους πόρους)
sw $ra, 4($sp) #αποθηκεύω τη διεύθυνση επιστροφής
sw $a0, 0($sp) #αποθηκεύω το όρισμα
slti $t0, $a0, 1 #ελέγχω κατά πόσο έχω φθάσει σε φύλλο
beq $t0, $zero, L1
li $v0, 1 #εάν έχω φθάσει σε φύλλο, θέτω την τιμή 1 και επιστρέφω
addi $sp, $sp, 8 #αποδεσμεύω τη μνήμη
jr $ra #επιστρέφω στον καλούντα

L1: addi $a0, $a0, -1 #εκτελείται εάν δεν έχω φθάσει σε φύλλο
jal myfactorial #καλώ αναδρομικά

lw $a0, 0($sp) # μετά την επιστροφή από την αναδρομή, ανακτώ το όρισμα
lw $ra, 4($sp) # μετά την επιστροφή από την αναδρομή ανακτώ τη διεύθυνση επιστροφής
addi $sp, $sp, 8 #αποδεσμεύω τη μνήμη
mul $v0, $a0, $v0 #πολ/ζω για να λάβω το αποτέλεσμα

jr $ra #γυρνώ ένα βήμα πίσω στην ιεραρχία της αναδρομής
